package parser;

/**
 * 算符优先关系表。包含算符优先关系的移入归约表以及相应状态的定义。
 * 根据优先级来决定移入归约关系，规则如下：
 * <ul>
 * <li>如果栈顶符号优先级大于读入符号，或者两者优先级相同但符号是左结合的，那么就对栈顶符号进行归约。</li>
 * <li>如果栈顶符号优先级小于读入符号，或者两者优先级相同但符号是右结合的，那么就将读入符号进行移入。</li>
 * </ul>
 * 两个符号之间只有三种关系：移入，归约以及错误。<br>
 * 为了使函数功能单一高效，归约又进一步细分为单目运算，二目运算，三目运算，以及括号匹配这四种。<br>
 * 错误类型则依据实验要求进行相应的分类。
 * @author Donald
 *
 */
public class OPP {

		/**
		 * 缺少左括号，-7
		 */
		public static final int ERRLEFTPAR = -7;
		/**
		 * 语法错误， -6
		 */
		public static final int ERRSYN = -6;
		/**
		 * 缺少操作数， -5
		 */
		public static final int ERROPERAND = -5;
		/**
		 * 类型错误， -4
		 */
		public static final int ERRTYPE = -4;
		/**
		 * 函数语法错误， -3
		 */
		public static final int ERRFUNCSYN = -3;
		/**
		 * 缺少右括号， -2
		 */
		public static final int ERRRIGHTPAR = -2;
		/**
		 * 三元运算异常， -1
		 */
		public static final int ERRTRINA = -1;
		/**
		 * 接受, 0
		 */
		public static final int ACCEPT = 0; 
		/**
		 * 单目运算， 1。包括-和！
		 */
		public static final int RDUNAOPER = 1;
		/**
		 * 双目运算归约， 2。包括+, -, *, /, ^, &, |以及关系运算。
		 */
		public static final int RDBINAOPER = 2;
		/**
		 * 三目运算归约， 3。包括?:
		 */
		public static final int RDTRINAOPER = 3; 
		/**
		 * 括号运算归约， 4。包含函数检测及运算，
		 */
		public static final int RDMATCH = 4;
		/**
		 * 移入操作， 5。
		 */
		public static final int SHIFT = 5;
		
	/**
	 * 移入归约表。其中行代表的是栈顶符号，列代表的是读入符号，而数字和上述静态变量相对应。<br>
	 * <ul>
	 * <li>func指的是函数，包括cos, sin, max, min</li>
	 * <li>md指的是multiple和divide，即乘除运算</li>
	 * <li>pm指的是plus和minus，即加减运算</li>
	 * <li>-指的是负号</li>
	 * <li>cmp指的关系运算，即大于,小于等等</li>
	 * <li>由于（）运算优先级最高，所以遇到）便进行归约，不压栈，所以栈顶符号中的）仅仅只是为了后续操作方便，没有实质意义。</li>
	 * </ul>
	 */
	public static final int table[][] = {
		/*栈顶*/ /*(  ) func - ^  md pm cmp ! &  |  ?  :  ,  $    读入字符*/
		/*(*/    {5, 4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,-1, 5,-2},
		/*)*/    {4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4},
		/*func*/ {5,-3,-3,-3,-3,-3,-3,-3,-3,-3,-3,-3,-3,-3,-3},
		/*-*/    {5, 4, 5, 5, 1, 1, 1, 1,-6,-4,-4, 1, 1, 1, 1},
		/*^*/    {5, 4, 5, 5, 5, 2, 2, 2,-6,-4,-4, 2, 2, 2, 2},
		/*md*/   {5, 4, 5, 5, 5, 2, 2, 2,-6,-4,-4, 2, 2, 2, 2},
		/*pm*/   {5, 4, 5, 5, 5, 5, 2, 2,-6,-4,-4, 2, 2, 2, 2},
		/*cmp*/  {5, 4, 5, 5, 5, 5, 5,-4,-6, 2, 2, 2,-1,-3, 2},
		/*!*/    {5, 4,-4,-4,-4,-4,-4, 5, 5, 1, 1, 1,-1,-3, 1},
		/*&*/    {5, 4,-4,-4,-4,-4,-4, 5, 5, 2, 2, 2,-1,-3, 2},
		/*|*/    {5, 4,-4,-4,-4,-4,-4, 5, 5, 5, 2, 2,-1,-3, 2},
		/*?*/    {5,-1, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,-1,-1},
		/*:*/    {5, 4, 5, 5, 5, 5, 5,-1,-1,-1,-1, 5,-1,-1, 3},
		/*,*/    {5, 4, 5, 5, 5, 5, 5,-3,-3,-3,-3, 5,-1, 5,-3},
		/*$*/    {5,-7, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,-1,-3, 0}
	};
}
